#pragma once

#include "structs.h" // For FName, FString, FVector, FRotator, TArray, FGuid, FGameplayTag, FGameplayTagContainer etc.

// Forward declarations for classes used in parameter structs, if not fully defined in structs.h
class UFortItemDefinition;
enum class EFortQuickBars : uint8_t;
enum class EInputEvent : uint8_t;
class UFortItem;
class UAthenaCosmeticItemDefinition;
enum class EAthenaCustomizationCategory : uint8_t;
class AFortPlayerPawn;
class UFortMontageItemDefinitionBase;
class AFortObjectiveBase;
enum class EFortObjectiveStatus : uint8_t;
enum class EStatCategory : uint8_t;
struct FVector_NetQuantize;
class ABuildingSMActor;
enum class EFortItemType : uint8_t;
class ABuildingActor;
class UGameplayAbility;
class APlayerController;
enum class EFortCrucibleWhitelistLevel : uint8_t;
class USoundBase;
class UAudioComponent;
enum class ERespawnCameraBehavior : uint8_t;
class UFortWeaponItemDefinition;
enum class EDeathCause : uint8_t;
enum class ESubGame : uint8_t;
struct FMcpVariantChannelInfo;
struct FFortAthenaLoadout;
enum class EDadBroHealthType : uint8_t;
class UMeshComponent;
enum class EFortPickupTossState : uint8_t; // From structs.h if fully defined
class UFortWorldItem;
struct FRecipe;
struct FQuickBar;
class UControllerComponent;
class AFortPlayerStateAthena;
class AActor;
struct FFortItemEntry;
struct FFortGameplayAttributeData;
struct FProfileUpdateSingle;
struct FDedicatedServerUrlContext;
class UAthenaItemWrapDefinition;


namespace SDK
{
namespace Params
{

//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// Function Athena_PlayerController.Athena_PlayerController_C.PawnPossessedDispatcher__DelegateSignature
struct Athena_PlayerController_C_PawnPossessedDispatcher__DelegateSignature_Params
{
public:
	class APawn* PossessedPawn;                                     // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena_PlayerController.Athena_PlayerController_C.ExecuteUbergraph_Athena_PlayerController
struct Athena_PlayerController_C_ExecuteUbergraph_Athena_PlayerController_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena_PlayerController.Athena_PlayerController_C.OnMusicPackLoaded__DelegateSignature
struct Athena_PlayerController_C_OnMusicPackLoaded__DelegateSignature_Params
{
public:
	class USoundBase* Music;                                             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartTime;                                         // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena_PlayerController.Athena_PlayerController_C.ChangeMusic
struct Athena_PlayerController_C_ChangeMusic_Params
{
public:
	class USoundBase* New_Music;                                         // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartTime;                                         // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Athena_PlayerController.Athena_PlayerController_C.FadeAudioComponents
struct Athena_PlayerController_C_FadeAudioComponents_Params
{
public:
	class UAudioComponent* NewMusicComponent;                                 // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent* PreviousMusicComponent;                            // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase* Music;                                             // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartTime;                                         // 0x18(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};


// Function FortniteGame.FortPlayerController.AddInventoryItemWithAlterationBasedOnLootLevel
struct FortPlayerController_AddInventoryItemWithAlterationBasedOnLootLevel_Params
{
public:
	struct FFortItemEntry                        ItemDescription;                                   // 0x0(0x54)(Parm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.AddInventoryItemWithAnimation
struct FortPlayerController_AddInventoryItemWithAnimation_Params
{
public:
	struct FFortItemEntry                        ItemDescription;                                   // 0x0(0x54)(Parm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.AddItemToQuickBars
struct FortPlayerController_AddItemToQuickBars_Params
{
public:
	class UFortItemDefinition* ItemDefinition;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortQuickBars                               QuickBarType;                                      // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SlotIndex;                                         // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.AlternateInteractCarryHoldStopped
struct FortPlayerController_AlternateInteractCarryHoldStopped_Params
{
public:
	class FName                                  InputActionName;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCompletedSuccessfully;                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.AreActionsBoundToSameKey
struct FortPlayerController_AreActionsBoundToSameKey_Params
{
public:
	class FName                                  FirstActionName;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SecondActionName;                                  // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                  InputEvent;                                        // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x11(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.BP_FindItemInstancesFromDefinition
struct FortPlayerController_BP_FindItemInstancesFromDefinition_Params
{
public:
	class UFortItemDefinition* ItemDefinition;                                    // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFortItem*>                     ItemArray;                                         // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ChangeActiveVariantForCosmeticItem
struct FortPlayerController_ChangeActiveVariantForCosmeticItem_Params
{
public:
	class FName                                  ItemTemplateToChange;                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          VariantChannelToChange;                            // 0x8(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          DesiredActiveVariant;                              // 0xC(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn* PreviewPawn;                                       // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.Cheat
struct FortPlayerController_Cheat_Params
{
public:
	class FString                                Msg;                                               // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.Cheat_ForceAthenaCosmeticItemInSlot
struct FortPlayerController_Cheat_ForceAthenaCosmeticItemInSlot_Params
{
public:
	class UAthenaCosmeticItemDefinition* CosmeticItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAthenaCustomizationCategory                 Slot;                                              // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Param_Index;                                       // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.Cheat_ForceCosmeticVariantChannels
struct FortPlayerController_Cheat_ForceCosmeticVariantChannels_Params
{
public:
	TArray<struct FMcpVariantChannelInfo>        CosmeticVariantChannels;                           // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.Cheat_ForcePlayEmoteItem
struct FortPlayerController_Cheat_ForcePlayEmoteItem_Params
{
public:
	class UFortMontageItemDefinitionBase* EmoteAsset;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.Cheat_StopObjectiveServer
struct FortPlayerController_Cheat_StopObjectiveServer_Params
{
public:
	class AFortObjectiveBase* Objective;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortObjectiveStatus                         Status;                                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.CheatAll
struct FortPlayerController_CheatAll_Params
{
public:
	class FString                                Msg;                                               // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.CheckPossessionOfAmountOfItems
struct FortPlayerController_CheckPossessionOfAmountOfItems_Params
{
public:
	EFortItemType                                Type;                                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmountToCheck;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientActivateSlot
struct FortPlayerController_ClientActivateSlot_Params
{
public:
	EFortQuickBars                               InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Slot;                                              // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivateDelay;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUpdatePreviousFocusedSlot;                        // 0xC(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceExecution;                                   // 0xD(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientAddScoreNumber
struct FortPlayerController_ClientAddScoreNumber_Params
{
public:
	int32                                        Score;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStatCategory                                ScoreCategory;                                     // 0x4(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                   ScoreLocation;                                     // 0x8(0xC)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisplayScoreOnPlayer;                             // 0x14(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientBotEnqueueCommand
struct FortPlayerController_ClientBotEnqueueCommand_Params
{
public:
	class FString                                CommandToEnqueue;                                  // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientBotSetModuleToUse
struct FortPlayerController_ClientBotSetModuleToUse_Params
{
public:
	class FString                                PilotCategory;                                     // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                NewModule;                                         // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bResetNow;                                         // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientConfirmTargetData
struct FortPlayerController_ClientConfirmTargetData_Params
{
public:
	uint16                                       UniqueId;                                          // 0x0(0x2)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuccess;                                          // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                HitReplaces;                                       // 0x8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientCreateOrJoinChatRoom
struct FortPlayerController_ClientCreateOrJoinChatRoom_Params
{
public:
	class FString                                ChatRoomId;                                        // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientDeveloper_GetConsoleVariable
struct FortPlayerController_ClientDeveloper_GetConsoleVariable_Params
{
public:
	class FString                                ConsoleVariable;                                   // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Value;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientEquipItem
struct FortPlayerController_ClientEquipItem_Params
{
public:
	struct FGuid                                 ItemGuid;                                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceExecution;                                   // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientExecuteInventoryItem
struct FortPlayerController_ClientExecuteInventoryItem_Params
{
public:
	struct FGuid                                 ItemGuid;                                          // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Delay;                                             // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceExecute;                                     // 0x14(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActivateSlotAfterSettingFocused;                  // 0x15(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ClientFailedToBeginEditingBuildingActor
struct FortPlayerController_ClientFailedToBeginEditingBuildingActor_Params
{
public:
	class ABuildingSMActor* BuildingActorToStopEditing;                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.ProcessMcpProfileUpdate
struct FortPlayerController_ProcessMcpProfileUpdate_Params
{
public:
	struct FProfileUpdateSingle                  Update;                                            // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.HasPermissionToEditWorld
struct FortPlayerController_HasPermissionToEditWorld_Params
{
public:
	class ABuildingActor* Building;                                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x8(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              Rotation;                                          // 0x14(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerController.IsActionInputIgnored
struct FortPlayerController_IsActionInputIgnored_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCheatManager.ShouldUseNewHeroLoadoutUI
struct FortCheatManager_ShouldUseNewHeroLoadoutUI_Params
{
public:
	class APlayerController* PC;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCheatManager.Crucible_SetWhitelisted
struct FortCheatManager_Crucible_SetWhitelisted_Params
{
public:
	EFortCrucibleWhitelistLevel                  WhitelistLevel;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCheatManager.McpJoinFromPartyInviteToken
struct FortCheatManager_McpJoinFromPartyInviteToken_Params
{
public:
	class FString                                Token;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsFromInvite;                                     // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCheatManager.StartWeatherEvent
struct FortCheatManager_StartWeatherEvent_Params
{
public:
	int32                                        WeatherEventIndex;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Intensity;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.BuildingFoundation.EditorOnlyUnloadPreviewLevel
struct BuildingFoundation_EditorOnlyUnloadPreviewLevel_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCharacterAttrSet.OnRep_Resistance
struct FortCharacterAttrSet_OnRep_Resistance_Params
{
public:
	struct FFortGameplayAttributeData            OldValue;                                          // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCharacterAttrSet.OnRep_Tech
struct FortCharacterAttrSet_OnRep_Tech_Params
{
public:
	struct FFortGameplayAttributeData            OldValue;                                          // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FortniteGame.BuildingPhoenixRepairActor.GetWeaponHasDurability
struct BuildingPhoenixRepairActor_GetWeaponHasDurability_Params
{
public:
	class UFortWorldItem* WeaponItem;                                        // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.BuildingPhoenixRepairActor.GetWeaponRepairRecipe
struct BuildingPhoenixRepairActor_GetWeaponRepairRecipe_Params
{
public:
	class AFortPlayerController* FPC;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRecipe                               OutRecipe;                                         // 0x8(0x38)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerControllerAthena.ClientStartRespawnPreparation
struct FortPlayerControllerAthena_ClientStartRespawnPreparation_Params
{
public:
	struct FVector                               RespawnLoc;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RespawnRot;                                        // 0xC(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                        RespawnCameraDist;                                 // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERespawnCameraBehavior                       InRespawnCameraBehavior;                           // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  HUDReasonText;                                     // 0x20(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerControllerAthena.PlayWinEffects
struct FortPlayerControllerAthena_PlayWinEffects_Params
{
public:
	class APawn* FinisherPawn;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWeaponItemDefinition* FinishingWeapon;                                   // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDeathCause                                  DeathCause;                                        // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAudioOnly;                                        // 0x11(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerControllerAthena.PostLobbyIslandTeleport
struct FortPlayerControllerAthena_PostLobbyIslandTeleport_Params
{
public:
	class AFortPlayerPawn* PlayerPawn;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortniteAutomationBlueprintLibrary.GetWrapPreviewObjects
struct FortniteAutomationBlueprintLibrary_GetWrapPreviewObjects_Params
{
public:
	ESubGame                                     SubGame;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UObject>>        ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortniteAutomationBlueprintLibrary.MakeLoadoutFromVariantChannelInfos
struct FortniteAutomationBlueprintLibrary_MakeLoadoutFromVariantChannelInfos_Params
{
public:
	TArray<struct FMcpVariantChannelInfo>        VariantInfo;                                       // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FFortAthenaLoadout                    ReturnValue;                                       // 0x10(0x50)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FortniteGame.DadBroHealthInterface.GetCurrentHealthType
struct DadBroHealthInterface_GetCurrentHealthType_Params
{
public:
	EDadBroHealthType                            ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortAccountBuffItem.IsActive
struct FortAccountBuffItem_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.ObjectInteractionBehavior.GetFortPlayerController
struct ObjectInteractionBehavior_GetFortPlayerController_Params
{
public:
	class AFortPlayerController* ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.DeleteObjects.GetDeleteActorsMeshComponents
struct UDeleteObjects_GetDeleteActorsMeshComponents_Params
{
public:
	TArray<class UMeshComponent*>                Components;                                        // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortAthenaMutator_TODOverride.GetTimeOfDaySpeedNames
struct FortAthenaMutator_TODOverride_GetTimeOfDaySpeedNames_Params
{
public:
	TArray<class FText>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortInGameMapManager.GetStaticCaptureSetupComplete
struct FortInGameMapManager_GetStaticCaptureSetupComplete_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerControllerPvE.ServerUpdateQuickBarRecordsCache
struct FortPlayerControllerPvE_ServerUpdateQuickBarRecordsCache_Params
{
public:
	struct FQuickBar                             PrimaryQuickBarRecord;                             // 0x0(0x48)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FQuickBar                             SecondaryQuickBarRecord;                           // 0x48(0x48)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortHealthSet.OnRep_MaxHealth
struct FortHealthSet_OnRep_MaxHealth_Params
{
public:
	struct FFortGameplayAttributeData            OldValue;                                          // 0x0(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortPlayerPawn.ClientNotifyAbilityFailed
struct FortPlayerPawn_ClientNotifyAbilityFailed_Params
{
public:
	class UGameplayAbility* FailedAbility;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 FailedReason;                                      // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCheatManager_Quests.CompleteAllQuestsByName
struct FortCheatManager_Quests_CompleteAllQuestsByName_Params
{
public:
	class FString                                QuestPartialName;                                  // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortCheatManagerSTW.SetWorldLevel
struct FortCheatManagerSTW_SetWorldLevel_Params
{
public:
	float                                        Level;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortMcpProfileCreative.RestoreDeletedIsland
struct FortMcpProfileCreative_RestoreDeletedIsland_Params
{
public:
	class FString                                PlotItemId;                                        // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDedicatedServerUrlContext            Context;                                           // 0x10(0x18)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic) // Assumed struct
};

// Function FortniteGame.FortKismetLibrary.RemoveControllerComponent
struct FortKismetLibrary_RemoveControllerComponent_Params
{
public:
	class AController* Controller;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UControllerComponent>      ControllerCompClass;                               // 0x8(0x8)(Parm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortMinigame.OverridePlayerSpawnLocation
struct FortMinigame_OverridePlayerSpawnLocation_Params
{
public:
	class APawn* PlayerPawn;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena* PlayerState;                                       // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               OutLocation;                                       // 0x10(0xC)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              OutRotation;                                       // 0x1C(0xC)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bOutRespawningOnGround;                            // 0x28(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x29(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.FortWorldMarker.PlayerStateDestroyed
struct FortWorldMarker_PlayerStateDestroyed_Params
{
public:
	class AActor* DestroyedActor;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.ThreatCloud.OnCloudHiddenChange
struct ThreatCloud_OnCloudHiddenChange_Params
{
public:
	bool                                         bCloudsAreHidden;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.ThreatCloud.OnLightningStrike
struct ThreatCloud_OnLightningStrike_Params
{
public:
	struct FVector                               StartLocation;                                     // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EndLocation;                                       // 0xC(0xC)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.WorldMapPinManager.CreateWorldMapPin
struct WorldMapPinManager_CreateWorldMapPin_Params
{
public:
	class FString                                TheaterId;                                         // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWorldMapPin* ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteGame.WrapPreviewGridActor.SetWrap
struct WrapPreviewGridActor_SetWrap_Params
{
public:
	class UAthenaItemWrapDefinition* NewWrap;                                           // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}
} // namespace SDK
```

-----

### 2\. `FortniteGame_classes.h` (Generated from `_functions.cpp` files)

This file provides minimal class definitions and forward declarations for all referenced Unreal Engine classes.

```cpp
#pragma once

#include "structs.h" // For UObject, TSubclassOf, FText etc.

// Engine Classes Forward Declarations (common UE classes)
class UWorld;
class AGameStateBase;
class APlayerController;
class APawn;
class USoundBase;
class UAudioComponent;
class UMeshComponent;
class AActor;
class AController;

namespace SDK
{
// Enums (often found in _enums.h, but we'll put them here for simplicity)
enum class EFortQuickBars : uint8_t
{
	Primary = 0,
	Secondary = 1,
	Max_None = 2,
};

enum class EInputEvent : uint8_t
{
	IE_Pressed = 0,
	IE_Released = 1,
